In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [4]:
data = Series(['one','two', np.nan, 'four'])

In [5]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [6]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
#drop and remove all null values => method: dropna

In [8]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [9]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [10]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [13]:
#drop any rows with a null valueclean_dframe = dframe.dropna()
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [14]:
#only drop rows that are missing all data (rows where all values are Null) => in this case, only drop the index-3 row
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [15]:
#specify to drop columns (column : axis 1)
#drop columns that have at least 1 null value
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
#because every column has a null value in it => all columns got dropped

In [18]:
#threshold the missing data
npn=np.nan
dframe2=DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [19]:
dframe2.dropna(thresh=2)
#drop rows that DON'T have at least 2 data points

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [20]:
dframe2.dropna(thresh=3)
#drop rows that DON'T have at least 3 data points

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [21]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [22]:
#fill all null values for 1
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [23]:

dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [25]:
#fill in differnet values for different columns
#pass a dictionary {column index: substitution value for null}
#exampel: in index-0 column, null values will be replaced with 0
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [28]:
#modify the existing object
#make the change permanent: use the assignment (equal sign)
dframe2 = dframe2.fillna(0)
#method 2:
#dframe2.fillna(0,inplace=True)

In [27]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0